fortebit/opentracker-stm32-core/boards.txt
Disco.menu.usb.none=None
Disco.menu.usb.HID=HID keyboard and mouse support (if available)
Disco.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#Disco.menu.usb.CDC=CDC (if available)
#Disco.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

# Optimizations
Nucleo_144.menu.opt.osstd=Smallest (-Os default)
Nucleo_144.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_144.menu.opt.osstd.build.flags.ldspecs=
Nucleo_144.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_144.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_144.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o1std=Fast (-O1)
Nucleo_144.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_144.menu.opt.o1std.build.flags.ldspecs=
Nucleo_144.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_144.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_144.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o2std=Faster (-O2)
Nucleo_144.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_144.menu.opt.o2std.build.flags.ldspecs=
Nucleo_144.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_144.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_144.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o3std=Fastest (-O3)
Nucleo_144.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_144.menu.opt.o3std.build.flags.ldspecs=
Nucleo_144.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_144.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_144.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.ogstd=Debug (-g)
Nucleo_144.menu.opt.ogstd.build.flags.optimize=-g -Og
Nucleo_144.menu.opt.ogstd.build.flags.ldspecs=

Nucleo_64.menu.opt.osstd=Smallest (-Os default)
Nucleo_64.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_64.menu.opt.osstd.build.flags.ldspecs=
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1std.build.flags.ldspecs=
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2std.build.flags.ldspecs=
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3std.build.flags.ldspecs=
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_64.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_64.menu.opt.ogstd=Debug (-g)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-g -Og
Nucleo_64.menu.opt.ogstd.build.flags.ldspecs=

Nucleo_32.menu.opt.osstd=Smallest (-Os default)
Nucleo_32.menu.opt.osstd.build.flags.optimize=-Os
Nucleo_32.menu.opt.osstd.build.flags.ldspecs=
Nucleo_32.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_32.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_32.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o1std=Fast (-O1)
Nucleo_32.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_32.menu.opt.o1std.build.flags.ldspecs=
Nucleo_32.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_32.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_32.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o2std=Faster (-O2)
Nucleo_32.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_32.menu.opt.o2std.build.flags.ldspecs=
Nucleo_32.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_32.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_32.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.o3std=Fastest (-O3)
Nucleo_32.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_32.menu.opt.o3std.build.flags.ldspecs=
Nucleo_32.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_32.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_32.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_32.menu.opt.ogstd=Debug (-g)
Nucleo_32.menu.opt.ogstd.build.flags.optimize=-g -Og
Nucleo_32.menu.opt.ogstd.build.flags.ldspecs=

Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.osstd.build.flags.optimize=-Os
Disco.menu.opt.osstd.build.flags.ldspecs=
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.oslto.build.flags.ldspecs=-flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1std.build.flags.ldspecs=
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o1lto.build.flags.ldspecs=-flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2std.build.flags.ldspecs=
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o2lto.build.flags.ldspecs=-flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3std.build.flags.ldspecs=
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.o3lto.build.flags.ldspecs=-flto
Disco.menu.opt.ogstd=Debug (-g)
Disco.menu.opt.ogstd.build.flags.optimize=-g -Og
Disco.menu.opt.ogstd.build.flags.ldspecs=


################################################################################
# OPENTRACKER_V3 board
# Support: USB CDC, Serial1/2/3/11 (USART1 on PA9/PA10, USART2 on PD5/PD6, USART3 on PD8/PD9, LPUART1 on PB10/PB11)

opentracker_3.name=Geolink OpenTracker v3

opentracker_3.build.vid=0x0483
opentracker_3.build.pid=0x5711
opentracker_3.vid.0=0x0483
opentracker_3.pid.0=0x5711

opentracker_3.build.core=arduino
opentracker_3.build.board=OPENTRACKER_V3
opentracker_3.build.extra_flags=-D{build.product_line} {build.enable_usb} -DALL_HWSERIAL -DOPENTRACKER_HW_REV=0x0300
opentracker_3.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
opentracker_3.build.board=OPENTRACKER_V3
opentracker_3.build.series=STM32L4xx
opentracker_3.build.product_line=STM32L433xx
opentracker_3.build.variant=OPENTRACKER_V3
opentracker_3.build.cmsis_lib_gcc=arm_cortexM4l_math

opentracker_3.node=""
opentracker_3.upload.maximum_size=131072
opentracker_3.upload.maximum_data_size=65536

# Modem menu
opentracker_3.menu.modem=Modem Model
opentracker_3.menu.modem.M95=M95 (Quad-Band 2.5G)
opentracker_3.menu.modem.M95.build.modem_flags=-DMODEM_M95=1
opentracker_3.menu.modem.UG96=UG96 (Penta-Band 3G)
opentracker_3.menu.modem.UG96.build.modem_flags=-DMODEM_UG96=1
opentracker_3.menu.modem.EG91=EG91 (Multi-Band 4G)
opentracker_3.menu.modem.EG91.build.modem_flags=-DMODEM_EG91=1
opentracker_3.menu.modem.BG96=BG96 (LWPA/NB-IoT 2.5G/4G)
opentracker_3.menu.modem.BG96.build.modem_flags=-DMODEM_BG96=1

# Upload menu
opentracker_3.menu.upload_method.STLink=STLink
opentracker_3.menu.upload_method.STLink.upload.protocol=STLink
opentracker_3.menu.upload_method.STLink.upload.tool=stlink_upload

# USB
opentracker_3.menu.usb.CDC=CDC
opentracker_3.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS
opentracker_3.menu.usb.none=None

# Optimizations
opentracker_3.menu.opt.osstd=Smallest (-Os default)
opentracker_3.menu.opt.osstd.build.flags.optimize=-Os
opentracker_3.menu.opt.osstd.build.flags.ldspecs=
opentracker_3.menu.opt.oslto=Smallest (-Os) with LTO
opentracker_3.menu.opt.oslto.build.flags.optimize=-Os -flto
opentracker_3.menu.opt.oslto.build.flags.ldspecs=-flto
opentracker_3.menu.opt.o1std=Fast (-O1)
opentracker_3.menu.opt.o1std.build.flags.optimize=-O1
opentracker_3.menu.opt.o1std.build.flags.ldspecs=
opentracker_3.menu.opt.o1lto=Fast (-O1) with LTO
opentracker_3.menu.opt.o1lto.build.flags.optimize=-O1 -flto
opentracker_3.menu.opt.o1lto.build.flags.ldspecs=-flto
opentracker_3.menu.opt.o2std=Faster (-O2)
opentracker_3.menu.opt.o2std.build.flags.optimize=-O2
opentracker_3.menu.opt.o2std.build.flags.ldspecs=
opentracker_3.menu.opt.o2lto=Faster (-O2) with LTO
opentracker_3.menu.opt.o2lto.build.flags.optimize=-O2 -flto
opentracker_3.menu.opt.o2lto.build.flags.ldspecs=-flto
opentracker_3.menu.opt.o3std=Fastest (-O3)
opentracker_3.menu.opt.o3std.build.flags.optimize=-O3
opentracker_3.menu.opt.o3std.build.flags.ldspecs=
opentracker_3.menu.opt.o3lto=Fastest (-O3) with LTO
opentracker_3.menu.opt.o3lto.build.flags.optimize=-O3 -flto
opentracker_3.menu.opt.o3lto.build.flags.ldspecs=-flto
opentracker_3.menu.opt.ogstd=Debug (-g)
opentracker_3.menu.opt.ogstd.build.flags.optimize=-g -Og
opentracker_3.menu.opt.ogstd.build.flags.ldspecs=
